; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	spectrograph0 - mode
	image1 - mode
	Star4 - direction
	Star1 - direction
	Star2 - direction
	GroundStation0 - direction
	Star3 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star3)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 spectrograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star3)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument5 spectrograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star3)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
	(supports instrument7 spectrograph0)
	(supports instrument7 image1)
	(calibration_target instrument7 Star2)
	(supports instrument8 image1)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 image1)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 Star3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
)
(:goal (and
	(pointing satellite2 Phenomenon16)
	(pointing satellite3 Star17)
	(have_image Planet5 image1)
	(have_image Star6 spectrograph0)
	(have_image Planet7 image1)
	(have_image Phenomenon8 spectrograph0)
	(have_image Phenomenon9 spectrograph0)
	(have_image Planet10 image1)
	(have_image Phenomenon11 spectrograph0)
	(have_image Planet12 image1)
	(have_image Star13 spectrograph0)
	(have_image Phenomenon14 image1)
	(have_image Planet15 spectrograph0)
	(have_image Phenomenon16 spectrograph0)
	(have_image Star17 spectrograph0)
))

)

; plan
1. (turn_to satellite3 star17 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 star17)
   goals met: 1 of 15
2. (turn_to satellite2 star3 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 star3)
   goals met: 1 of 15
3. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 15
4. (calibrate satellite2 instrument5 star3)
   added: (calibrated instrument5)
   goals met: 1 of 15
5. (turn_to satellite2 planet10 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet10)
   goals met: 1 of 15
6. (take_image satellite2 planet10 instrument5 image1)
   added: (have_image planet10 image1)
   goals met: 2 of 15
7. (turn_to satellite2 phenomenon9 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon9)
   goals met: 2 of 15
8. (take_image satellite2 phenomenon9 instrument5 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 3 of 15
9. (turn_to satellite2 phenomenon8 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon8)
   goals met: 3 of 15
10. (take_image satellite2 phenomenon8 instrument5 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 4 of 15
11. (turn_to satellite2 phenomenon14 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon14)
   goals met: 4 of 15
12. (take_image satellite2 phenomenon14 instrument5 image1)
   added: (have_image phenomenon14 image1)
   goals met: 5 of 15
13. (turn_to satellite2 phenomenon11 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon11)
   goals met: 5 of 15
14. (take_image satellite2 phenomenon11 instrument5 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 6 of 15
15. (turn_to satellite2 planet12 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 planet12)
   goals met: 6 of 15
16. (take_image satellite2 planet12 instrument5 image1)
   added: (have_image planet12 image1)
   goals met: 7 of 15
17. (turn_to satellite2 planet15 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet15)
   goals met: 7 of 15
18. (take_image satellite2 planet15 instrument5 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 8 of 15
19. (turn_to satellite2 planet5 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet5)
   goals met: 8 of 15
20. (take_image satellite2 planet5 instrument5 image1)
   added: (have_image planet5 image1)
   goals met: 9 of 15
21. (turn_to satellite2 planet7 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet7)
   goals met: 9 of 15
22. (take_image satellite2 planet7 instrument5 image1)
   added: (have_image planet7 image1)
   goals met: 10 of 15
23. (turn_to satellite2 star13 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star13)
   goals met: 10 of 15
24. (take_image satellite2 star13 instrument5 spectrograph0)
   added: (have_image star13 spectrograph0)
   goals met: 11 of 15
25. (turn_to satellite2 star17 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star17)
   goals met: 11 of 15
26. (take_image satellite2 star17 instrument5 spectrograph0)
   added: (have_image star17 spectrograph0)
   goals met: 12 of 15
27. (turn_to satellite2 star6 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 star6)
   goals met: 12 of 15
28. (take_image satellite2 star6 instrument5 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 13 of 15
29. (turn_to satellite2 phenomenon16 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 phenomenon16)
   goals met: 14 of 15
30. (take_image satellite2 phenomenon16 instrument5 spectrograph0)
   added: (have_image phenomenon16 spectrograph0)
   goals met: 15 of 15
